app/controllers/account_activations_controller.rb

    def edit
      # userに代入　→　Userテーブルから　URLから取得したemailの値を持つ　userデータを取得して
      user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "example@railstutorial.org"], ["LIMIT", 1]]